Repository: RobertPietraru/Home
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Your tests
hu: Saját tesztek

source: No title
hu: Nincs cím

source: Play
hu: Lejátszás

# continueText
source: Continue
hu: Folytatás

source: Create
hu: Létrehozás

source: Welcome
hu: Üdvözöllek

source: Start new session
hu: Új munkamenet indítása

source: No question added
hu: Nincs hozzáadott kérdés

source: Option
hu: Lehetőség

source: Tap to modify question
hu: Koppints a kérdés módosításához

source: There's no question
hu: Nincs kérdés

# suggestContentWithAI
source: Sugest content with AI
hu: Tartalom javaslata mesterséges intelligenciával

# addOptionsRow
source: Add row of options
hu: Opciók sorának hozzáadása

# removeOptionsRow
source: Remove row of options
hu: Opciók sorának eltávolítása

source: Add image
hu: Kép hozzáadása

source: Change image
hu: Kép módosítása

source: Delete question
hu: Kérdés törlése

source: Title
hu: Cím

source: Description
hu: Leírás

source: Private
hu: Privát

source: Public
hu: Nyilvános

source: Password
hu: Jelszó

source: Waiting for students
hu: Várakozás a diákokra

# sessionIsCreated
source: The session is created. Waiting for students
hu: A munkamenet létrejött. Várakozás a diákokra

source: Start
hu: Indítás

# codeCopied
source: The code was copied
hu: A kód másolva lett

# noTests
source: You don't have any tests
hu: Nincsenek tesztek

source: Unsaved
hu: Nem mentett

# someoneForgotTo
source: Someone forgot to add a question here 😁
hu: Valaki elfelejtett itt egy kérdést hozzáadni 😁

source: Login
hu: Bejelentkezés

source: Save
hu: Mentés

source: Yes
hu: Igen

source: Test editor
hu: Teszt szerkesztő

# areYouSureNoSave
source: Are you sure you want to exit without saving?
hu: Biztosan kilépsz mentés nélkül?

source: Tap to modify
hu: Koppints a módosításhoz

source: Is it correct?
hu: Helyes-e?

source: Register
hu: Regisztráció

# completeToContinue
source: Complete fields to continue
hu: A folytatáshoz töltsd ki a mezőket

source: Don't have an account?
hu: Nincs fiókod?

source: Forgot your password?
hu: Elfelejtetted a jelszavad?

source: Confirm password
hu: Jelszó megerősítése

source: Already have an account?
hu: Már van fiókod?

source: Fill in to continue
hu: A folytatáshoz töltsd ki

source: Camera
hu: Kamera

source: Gallery
hu: Galéria

source: No
hu: Nem

source: Podium
hu: Díszlépcső

# congrats
source: Congrats everyone🎉🎉
hu: Gratulálok mindenkinek🎉🎉

source: Leaderboard
hu: Ranglista

source: Response registered
hu: Válasz rögzítve

source: You ran out of time
hu: Kifutottál az időbő l

# emailIsInvalid
source: The email is invalid
hu: Az e-mail érvénytelen

source: You must provide an email
hu: Meg kell adnod egy e-mailt

# youMustConfirmThePassword
source: You must confirm your password
hu: Meg kell erősítened a jelszót

source: Passwords don't match
hu: A jelszavak nem egyeznek

# passwordToWeak
source: Password is too weak or invalid
hu: A jelszó túl gyenge vagy érvénytelen

source: You must provide a password
hu: Meg kell adnod egy jelszót

# quizNotFound
source: The quiz was not found
hu: A kvíz nem található

source: There was an error:
hu: Hiba történt:

# youAreNotConnected
source: You are not connected to the interent
hu: Nincs internetkapcsolat

# yourQuizOnlyHasOne
source: Your quiz only has one question. That's why you can't delete it
hu: A kvízed csak egy kérdést tartalmaz. Ezért nem tudod törölni

# nameAlreadyUsed
source: The name you provided is already in use
hu: A megadott név már használatban van

source: Session not found
hu: Munkamenet nem található

# ifYouLeaveSession
source: If you leave the session, it will close
hu: Ha elhagyod a munkamenetet, az bezáródik

source: Stay
hu: Maradás

source: Insert code to connect
hu: Kód beillesztése a csatlakozáshoz

source: Connect
hu: Csatlakozás

source: Name
hu: Név

source: Choose a name
hu: Válassz egy nevet

source: Code
hu: Kód

source: Search for session
hu: Keresés munkamenetek között

source: Select a language
hu: Válassz nyelvet

source: There's nobody else
hu: Nincs más senki

# emailNotFound
source: Account not found
hu: Fiók nem található

source: Language
hu: Nyelv

source: Leave
hu: Hagyj el

source: Lesson
hu: Az óra

# needQuestionToGenerate
source: You need to write a question before generating
hu: Mielőtt generálni tudnál, írj be egy kérdést
